zmzdh/CAN_st_test/Drivers/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_canfd.h
#define    CANFD_CFDC0CTR_BOEIE_Pos                               (11U)
#define    CANFD_CFDC0CTR_BOEIE_Msk                               (0x1U << CANFD_CFDC0CTR_BOEIE_Pos)
#define    CANFD_CFDC0CTR_BOEIE                                   CANFD_CFDC0CTR_BOEIE_Msk

#define    CANFD_CFDC0CTR_EPIE_Pos                                (10U)
#define    CANFD_CFDC0CTR_EPIE_Msk                                (0x1U << CANFD_CFDC0CTR_EPIE_Pos)
#define    CANFD_CFDC0CTR_EPIE                                    CANFD_CFDC0CTR_EPIE_Msk

#define    CANFD_CFDC0CTR_EWIE_Pos                                (9U)
#define    CANFD_CFDC0CTR_EWIE_Msk                                (0x1U << CANFD_CFDC0CTR_EWIE_Pos)
#define    CANFD_CFDC0CTR_EWIE                                    CANFD_CFDC0CTR_EWIE_Msk

#define    CANFD_CFDC0CTR_BEIE_Pos                                (8U)
#define    CANFD_CFDC0CTR_BEIE_Msk                                (0x1U << CANFD_CFDC0CTR_BEIE_Pos)
#define    CANFD_CFDC0CTR_BEIE                                    CANFD_CFDC0CTR_BEIE_Msk

#define    CANFD_CFDC0CTR_RTBO_Pos                                (3U)
#define    CANFD_CFDC0CTR_RTBO_Msk                                (0x1U << CANFD_CFDC0CTR_RTBO_Pos)
#define    CANFD_CFDC0CTR_RTBO                                    CANFD_CFDC0CTR_RTBO_Msk

#define    CANFD_CFDC0CTR_CSLPR_Pos                               (2U)
#define    CANFD_CFDC0CTR_CSLPR_Msk                               (0x1U << CANFD_CFDC0CTR_CSLPR_Pos)
#define    CANFD_CFDC0CTR_CSLPR                                   CANFD_CFDC0CTR_CSLPR_Msk

#define    CANFD_CFDC0CTR_CHMDC_Pos                               (0U)
#define    CANFD_CFDC0CTR_CHMDC_Msk                               (0x3U << CANFD_CFDC0CTR_CHMDC_Pos)
#define    CANFD_CFDC0CTR_CHMDC                                   CANFD_CFDC0CTR_CHMDC_Msk

#define    CANFD_CFDC0STS_TEC_Pos                                 (24U)
#define    CANFD_CFDC0STS_TEC_Msk                                 (0xffU << CANFD_CFDC0STS_TEC_Pos)
#define    CANFD_CFDC0STS_TEC                                     CANFD_CFDC0STS_TEC_Msk

#define    CANFD_CFDC0STS_REC_Pos                                 (16U)
#define    CANFD_CFDC0STS_REC_Msk                                 (0xffU << CANFD_CFDC0STS_REC_Pos)
#define    CANFD_CFDC0STS_REC                                     CANFD_CFDC0STS_REC_Msk

#define    CANFD_CFDC0STS_ESIF_Pos                                (8U)
#define    CANFD_CFDC0STS_ESIF_Msk                                (0x1U << CANFD_CFDC0STS_ESIF_Pos)
#define    CANFD_CFDC0STS_ESIF                                    CANFD_CFDC0STS_ESIF_Msk

#define    CANFD_CFDC0STS_COMSTS_Pos                              (7U)
#define    CANFD_CFDC0STS_COMSTS_Msk                              (0x1U << CANFD_CFDC0STS_COMSTS_Pos)
#define    CANFD_CFDC0STS_COMSTS                                  CANFD_CFDC0STS_COMSTS_Msk

#define    CANFD_CFDC0STS_RECSTS_Pos                              (6U)
#define    CANFD_CFDC0STS_RECSTS_Msk                              (0x1U << CANFD_CFDC0STS_RECSTS_Pos)
#define    CANFD_CFDC0STS_RECSTS                                  CANFD_CFDC0STS_RECSTS_Msk

#define    CANFD_CFDC0STS_TRMSTS_Pos                              (5U)
#define    CANFD_CFDC0STS_TRMSTS_Msk                              (0x1U << CANFD_CFDC0STS_TRMSTS_Pos)
#define    CANFD_CFDC0STS_TRMSTS                                  CANFD_CFDC0STS_TRMSTS_Msk

#define    CANFD_CFDC0STS_BOSTS_Pos                               (4U)
#define    CANFD_CFDC0STS_BOSTS_Msk                               (0x1U << CANFD_CFDC0STS_BOSTS_Pos)
#define    CANFD_CFDC0STS_BOSTS                                   CANFD_CFDC0STS_BOSTS_Msk

#define    CANFD_CFDC0STS_EPSTS_Pos                               (3U)
#define    CANFD_CFDC0STS_EPSTS_Msk                               (0x1U << CANFD_CFDC0STS_EPSTS_Pos)
#define    CANFD_CFDC0STS_EPSTS                                   CANFD_CFDC0STS_EPSTS_Msk

#define    CANFD_CFDC0STS_CSLPSTS_Pos                             (2U)
#define    CANFD_CFDC0STS_CSLPSTS_Msk                             (0x1U << CANFD_CFDC0STS_CSLPSTS_Pos)
#define    CANFD_CFDC0STS_CSLPSTS                                 CANFD_CFDC0STS_CSLPSTS_Msk

#define    CANFD_CFDC0STS_CHLTSTS_Pos                             (1U)
#define    CANFD_CFDC0STS_CHLTSTS_Msk                             (0x1U << CANFD_CFDC0STS_CHLTSTS_Pos)
#define    CANFD_CFDC0STS_CHLTSTS                                 CANFD_CFDC0STS_CHLTSTS_Msk

#define    CANFD_CFDC0STS_CRSTSTS_Pos                             (0U)
#define    CANFD_CFDC0STS_CRSTSTS_Msk                             (0x1U << CANFD_CFDC0STS_CRSTSTS_Pos)
#define    CANFD_CFDC0STS_CRSTSTS                                 CANFD_CFDC0STS_CRSTSTS_Msk

#define    CANFD_CFDC0ERFL_CRCREG_Pos                             (16U)
#define    CANFD_CFDC0ERFL_CRCREG_Msk                             (0x7fffU << CANFD_CFDC0ERFL_CRCREG_Pos)
#define    CANFD_CFDC0ERFL_CRCREG                                 CANFD_CFDC0ERFL_CRCREG_Msk

#define    CANFD_CFDC0ERFL_ADERR_Pos                              (14U)
#define    CANFD_CFDC0ERFL_ADERR_Msk                              (0x1U << CANFD_CFDC0ERFL_ADERR_Pos)
#define    CANFD_CFDC0ERFL_ADERR                                  CANFD_CFDC0ERFL_ADERR_Msk

#define    CANFD_CFDC0ERFL_B0ERR_Pos                              (13U)
#define    CANFD_CFDC0ERFL_B0ERR_Msk                              (0x1U << CANFD_CFDC0ERFL_B0ERR_Pos)
#define    CANFD_CFDC0ERFL_B0ERR                                  CANFD_CFDC0ERFL_B0ERR_Msk

#define    CANFD_CFDC0ERFL_B1ERR_Pos                              (12U)
#define    CANFD_CFDC0ERFL_B1ERR_Msk                              (0x1U << CANFD_CFDC0ERFL_B1ERR_Pos)
#define    CANFD_CFDC0ERFL_B1ERR                                  CANFD_CFDC0ERFL_B1ERR_Msk

#define    CANFD_CFDC0ERFL_CERR_Pos                               (11U)
#define    CANFD_CFDC0ERFL_CERR_Msk                               (0x1U << CANFD_CFDC0ERFL_CERR_Pos)
#define    CANFD_CFDC0ERFL_CERR                                   CANFD_CFDC0ERFL_CERR_Msk

#define    CANFD_CFDC0ERFL_AERR_Pos                               (10U)
#define    CANFD_CFDC0ERFL_AERR_Msk                               (0x1U << CANFD_CFDC0ERFL_AERR_Pos)
#define    CANFD_CFDC0ERFL_AERR                                   CANFD_CFDC0ERFL_AERR_Msk

