zmzdh/CAN_st_test/Drivers/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_canfd.h
#define    CANFD_CFDC0ERFL_FERR_Pos                               (9U)
#define    CANFD_CFDC0ERFL_FERR_Msk                               (0x1U << CANFD_CFDC0ERFL_FERR_Pos)
#define    CANFD_CFDC0ERFL_FERR                                   CANFD_CFDC0ERFL_FERR_Msk

#define    CANFD_CFDC0ERFL_SERR_Pos                               (8U)
#define    CANFD_CFDC0ERFL_SERR_Msk                               (0x1U << CANFD_CFDC0ERFL_SERR_Pos)
#define    CANFD_CFDC0ERFL_SERR                                   CANFD_CFDC0ERFL_SERR_Msk

#define    CANFD_CFDC0ERFL_ALF_Pos                                (7U)
#define    CANFD_CFDC0ERFL_ALF_Msk                                (0x1U << CANFD_CFDC0ERFL_ALF_Pos)
#define    CANFD_CFDC0ERFL_ALF                                    CANFD_CFDC0ERFL_ALF_Msk

#define    CANFD_CFDC0ERFL_BLF_Pos                                (6U)
#define    CANFD_CFDC0ERFL_BLF_Msk                                (0x1U << CANFD_CFDC0ERFL_BLF_Pos)
#define    CANFD_CFDC0ERFL_BLF                                    CANFD_CFDC0ERFL_BLF_Msk

#define    CANFD_CFDC0ERFL_OVLF_Pos                               (5U)
#define    CANFD_CFDC0ERFL_OVLF_Msk                               (0x1U << CANFD_CFDC0ERFL_OVLF_Pos)
#define    CANFD_CFDC0ERFL_OVLF                                   CANFD_CFDC0ERFL_OVLF_Msk

#define    CANFD_CFDC0ERFL_BORF_Pos                               (4U)
#define    CANFD_CFDC0ERFL_BORF_Msk                               (0x1U << CANFD_CFDC0ERFL_BORF_Pos)
#define    CANFD_CFDC0ERFL_BORF                                   CANFD_CFDC0ERFL_BORF_Msk

#define    CANFD_CFDC0ERFL_BOEF_Pos                               (3U)
#define    CANFD_CFDC0ERFL_BOEF_Msk                               (0x1U << CANFD_CFDC0ERFL_BOEF_Pos)
#define    CANFD_CFDC0ERFL_BOEF                                   CANFD_CFDC0ERFL_BOEF_Msk

#define    CANFD_CFDC0ERFL_EPF_Pos                                (2U)
#define    CANFD_CFDC0ERFL_EPF_Msk                                (0x1U << CANFD_CFDC0ERFL_EPF_Pos)
#define    CANFD_CFDC0ERFL_EPF                                    CANFD_CFDC0ERFL_EPF_Msk

#define    CANFD_CFDC0ERFL_EWF_Pos                                (1U)
#define    CANFD_CFDC0ERFL_EWF_Msk                                (0x1U << CANFD_CFDC0ERFL_EWF_Pos)
#define    CANFD_CFDC0ERFL_EWF                                    CANFD_CFDC0ERFL_EWF_Msk

#define    CANFD_CFDC0ERFL_BEF_Pos                                (0U)
#define    CANFD_CFDC0ERFL_BEF_Msk                                (0x1U << CANFD_CFDC0ERFL_BEF_Pos)
#define    CANFD_CFDC0ERFL_BEF                                    CANFD_CFDC0ERFL_BEF_Msk

#define    CANFD_CFDC0DCFG_DSJW_Pos                               (24U)
#define    CANFD_CFDC0DCFG_DSJW_Msk                               (0xfU << CANFD_CFDC0DCFG_DSJW_Pos)
#define    CANFD_CFDC0DCFG_DSJW                                   CANFD_CFDC0DCFG_DSJW_Msk

#define    CANFD_CFDC0DCFG_DTSEG2_Pos                             (16U)
#define    CANFD_CFDC0DCFG_DTSEG2_Msk                             (0xfU << CANFD_CFDC0DCFG_DTSEG2_Pos)
#define    CANFD_CFDC0DCFG_DTSEG2                                 CANFD_CFDC0DCFG_DTSEG2_Msk

#define    CANFD_CFDC0DCFG_DTSEG1_Pos                             (8U)
#define    CANFD_CFDC0DCFG_DTSEG1_Msk                             (0x1fU << CANFD_CFDC0DCFG_DTSEG1_Pos)
#define    CANFD_CFDC0DCFG_DTSEG1                                 CANFD_CFDC0DCFG_DTSEG1_Msk

#define    CANFD_CFDC0DCFG_DBRP_Pos                               (0U)
#define    CANFD_CFDC0DCFG_DBRP_Msk                               (0xffU << CANFD_CFDC0DCFG_DBRP_Pos)
#define    CANFD_CFDC0DCFG_DBRP                                   CANFD_CFDC0DCFG_DBRP_Msk

#define    CANFD_CFDC0FDCFG_CLOE_Pos                              (30U)
#define    CANFD_CFDC0FDCFG_CLOE_Msk                              (0x1U << CANFD_CFDC0FDCFG_CLOE_Pos)
#define    CANFD_CFDC0FDCFG_CLOE                                  CANFD_CFDC0FDCFG_CLOE_Msk

#define    CANFD_CFDC0FDCFG_REFE_Pos                              (29U)
#define    CANFD_CFDC0FDCFG_REFE_Msk                              (0x1U << CANFD_CFDC0FDCFG_REFE_Pos)
#define    CANFD_CFDC0FDCFG_REFE                                  CANFD_CFDC0FDCFG_REFE_Msk

#define    CANFD_CFDC0FDCFG_FDOE_Pos                              (28U)
#define    CANFD_CFDC0FDCFG_FDOE_Msk                              (0x1U << CANFD_CFDC0FDCFG_FDOE_Pos)
#define    CANFD_CFDC0FDCFG_FDOE                                  CANFD_CFDC0FDCFG_FDOE_Msk

#define    CANFD_CFDC0FDCFG_TDCO_Pos                              (16U)
#define    CANFD_CFDC0FDCFG_TDCO_Msk                              (0xffU << CANFD_CFDC0FDCFG_TDCO_Pos)
#define    CANFD_CFDC0FDCFG_TDCO                                  CANFD_CFDC0FDCFG_TDCO_Msk

#define    CANFD_CFDC0FDCFG_RPNMD_Pos                             (12U)
#define    CANFD_CFDC0FDCFG_RPNMD_Msk                             (0x3U << CANFD_CFDC0FDCFG_RPNMD_Pos)
#define    CANFD_CFDC0FDCFG_RPNMD                                 CANFD_CFDC0FDCFG_RPNMD_Msk

#define    CANFD_CFDC0FDCFG_ESIC_Pos                              (10U)
#define    CANFD_CFDC0FDCFG_ESIC_Msk                              (0x1U << CANFD_CFDC0FDCFG_ESIC_Pos)
#define    CANFD_CFDC0FDCFG_ESIC                                  CANFD_CFDC0FDCFG_ESIC_Msk

#define    CANFD_CFDC0FDCFG_TDCE_Pos                              (9U)
#define    CANFD_CFDC0FDCFG_TDCE_Msk                              (0x1U << CANFD_CFDC0FDCFG_TDCE_Pos)
#define    CANFD_CFDC0FDCFG_TDCE                                  CANFD_CFDC0FDCFG_TDCE_Msk

#define    CANFD_CFDC0FDCFG_TDCOC_Pos                             (8U)
#define    CANFD_CFDC0FDCFG_TDCOC_Msk                             (0x1U << CANFD_CFDC0FDCFG_TDCOC_Pos)
#define    CANFD_CFDC0FDCFG_TDCOC                                 CANFD_CFDC0FDCFG_TDCOC_Msk

#define    CANFD_CFDC0FDCFG_EOCCFG_Pos                            (0U)
#define    CANFD_CFDC0FDCFG_EOCCFG_Msk                            (0x7U << CANFD_CFDC0FDCFG_EOCCFG_Pos)
#define    CANFD_CFDC0FDCFG_EOCCFG                                CANFD_CFDC0FDCFG_EOCCFG_Msk

#define    CANFD_CFDC0FDCTR_KEY_Pos                               (24U)
#define    CANFD_CFDC0FDCTR_KEY_Msk                               (0xffU << CANFD_CFDC0FDCTR_KEY_Pos)
#define    CANFD_CFDC0FDCTR_KEY                                   CANFD_CFDC0FDCTR_KEY_Msk

#define    CANFD_CFDC0FDCTR_PNMDC_Pos                             (16U)
#define    CANFD_CFDC0FDCTR_PNMDC_Msk                             (0x3U << CANFD_CFDC0FDCTR_PNMDC_Pos)
#define    CANFD_CFDC0FDCTR_PNMDC                                 CANFD_CFDC0FDCTR_PNMDC_Msk

#define    CANFD_CFDC0FDCTR_SOCCLR_Pos                            (1U)
#define    CANFD_CFDC0FDCTR_SOCCLR_Msk                            (0x1U << CANFD_CFDC0FDCTR_SOCCLR_Pos)
#define    CANFD_CFDC0FDCTR_SOCCLR                                CANFD_CFDC0FDCTR_SOCCLR_Msk

#define    CANFD_CFDC0FDCTR_EOCCLR_Pos                            (0U)
#define    CANFD_CFDC0FDCTR_EOCCLR_Msk                            (0x1U << CANFD_CFDC0FDCTR_EOCCLR_Pos)
#define    CANFD_CFDC0FDCTR_EOCCLR                                CANFD_CFDC0FDCTR_EOCCLR_Msk

#define    CANFD_CFDC0FDSTS_SOC_Pos                               (24U)
#define    CANFD_CFDC0FDSTS_SOC_Msk                               (0xffU << CANFD_CFDC0FDSTS_SOC_Pos)
#define    CANFD_CFDC0FDSTS_SOC                                   CANFD_CFDC0FDSTS_SOC_Msk

#define    CANFD_CFDC0FDSTS_EOC_Pos                               (16U)
#define    CANFD_CFDC0FDSTS_EOC_Msk                               (0xffU << CANFD_CFDC0FDSTS_EOC_Pos)
#define    CANFD_CFDC0FDSTS_EOC                                   CANFD_CFDC0FDSTS_EOC_Msk

