zmzdh/CAN_st_test/Drivers/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_canfd.h
#define    FL_CANFD_CFDC_DEPTH_0                                  (0x0U << CANFD_CFDCFCC_CFDC_Pos)
#define    FL_CANFD_CFDC_DEPTH_4                                  (0x1U << CANFD_CFDCFCC_CFDC_Pos)
#define    FL_CANFD_CFDC_DEPTH_8                                  (0x2U << CANFD_CFDCFCC_CFDC_Pos)
#define    FL_CANFD_CFDC_DEPTH_16                                 (0x3U << CANFD_CFDCFCC_CFDC_Pos)
#define    FL_CANFD_CFDC_DEPTH_32                                 (0x4U << CANFD_CFDCFCC_CFDC_Pos)
#define    FL_CANFD_CFDC_DEPTH_48                                 (0x5U << CANFD_CFDCFCC_CFDC_Pos)


#define    FL_CANFD_CFTML_TXMB0                                   (0x0U << CANFD_CFDCFCC_CFTML_Pos)
#define    FL_CANFD_CFTML_TXMB1                                   (0x1U << CANFD_CFDCFCC_CFTML_Pos)
#define    FL_CANFD_CFTML_TXMB2                                   (0x2U << CANFD_CFDCFCC_CFTML_Pos)
#define    FL_CANFD_CFTML_TXMB3                                   (0x3U << CANFD_CFDCFCC_CFTML_Pos)


#define    FL_CANFD_CFIGCV_1P8_FULL                               (0x0U << CANFD_CFDCFCC_CFIGCV_Pos)
#define    FL_CANFD_CFIGCV_1P4_FULL                               (0x1U << CANFD_CFDCFCC_CFIGCV_Pos)
#define    FL_CANFD_CFIGCV_3P8_FULL                               (0x2U << CANFD_CFDCFCC_CFIGCV_Pos)
#define    FL_CANFD_CFIGCV_1P2_FULL                               (0x3U << CANFD_CFDCFCC_CFIGCV_Pos)
#define    FL_CANFD_CFIGCV_5P8_FULL                               (0x4U << CANFD_CFDCFCC_CFIGCV_Pos)
#define    FL_CANFD_CFIGCV_3P4_FULL                               (0x5U << CANFD_CFDCFCC_CFIGCV_Pos)
#define    FL_CANFD_CFIGCV_7P8_FULL                               (0x6U << CANFD_CFDCFCC_CFIGCV_Pos)
#define    FL_CANFD_CFIGCV_FULL                                   (0x7U << CANFD_CFDCFCC_CFIGCV_Pos)


#define    FL_CANFD_CFIM_REACH_RFIGCV                             (0x0U << CANFD_CFDCFCC_CFIM_Pos)
#define    FL_CANFD_CFIM_EVERY_MESSAGE                            (0x1U << CANFD_CFDCFCC_CFIM_Pos)


#define    FL_CANFD_CFITR_REF_CLOCK_MUL_1                         (0x0U << CANFD_CFDCFCC_CFITR_Pos)
#define    FL_CANFD_CFITR_REF_CLOCK_MUL_10                        (0x1U << CANFD_CFDCFCC_CFITR_Pos)


#define    FL_CANFD_CFITSS_REF_CLOCK                              (0x0U << CANFD_CFDCFCC_CFITSS_Pos)
#define    FL_CANFD_CFITSS_BIT_CLOCK                              (0x1U << CANFD_CFDCFCC_CFITSS_Pos)


#define    FL_CANFD_CFM_RX_FIFO                                   (0x0U << CANFD_CFDCFCC_CFM_Pos)
#define    FL_CANFD_CFM_TX_FIFO                                   (0x1U << CANFD_CFDCFCC_CFM_Pos)


#define    FL_CANFD_CFPLS_SIZE_8                                  (0x0U << CANFD_CFDCFCC_CFPLS_Pos)
#define    FL_CANFD_CFPLS_SIZE_12                                 (0x1U << CANFD_CFDCFCC_CFPLS_Pos)
#define    FL_CANFD_CFPLS_SIZE_16                                 (0x2U << CANFD_CFDCFCC_CFPLS_Pos)
#define    FL_CANFD_CFPLS_SIZE_20                                 (0x3U << CANFD_CFDCFCC_CFPLS_Pos)
#define    FL_CANFD_CFPLS_SIZE_24                                 (0x4U << CANFD_CFDCFCC_CFPLS_Pos)
#define    FL_CANFD_CFPLS_SIZE_32                                 (0x5U << CANFD_CFDCFCC_CFPLS_Pos)
#define    FL_CANFD_CFPLS_SIZE_48                                 (0x6U << CANFD_CFDCFCC_CFPLS_Pos)
#define    FL_CANFD_CFPLS_SIZE_64                                 (0x7U << CANFD_CFDCFCC_CFPLS_Pos)


#define    FL_CANFD_TXMODE_CONTINUOUS                             (0x0U << CANFD_CFDTMCi_TMOM_Pos)
#define    FL_CANFD_TXMODE_ONE_SHOT                               (0x1U << CANFD_CFDTMCi_TMOM_Pos)


#define    FL_CANFD_TMTRF_NO_RESULT                               (0x0U << CANFD_CFDTMSTSj_TMTRF_Pos)
#define    FL_CANFD_TMTRF_TX_ABORTED                              (0x1U << CANFD_CFDTMSTSj_TMTRF_Pos)
#define    FL_CANFD_TMTRF_TX_SUCCESSFUL_WITHOUT_ABORT_REQUESTED   (0x2U << CANFD_CFDTMSTSj_TMTRF_Pos)
#define    FL_CANFD_TMTRF_TX_SUCCESSFUL_WITH_ABORT_REQUESTED      (0x3U << CANFD_CFDTMSTSj_TMTRF_Pos)

#define    FL_CANFD_TXQDC_DEPTH_0                                 (0x0U << CANFD_CFDTXQCC_TXQDC_Pos)
#define    FL_CANFD_TXQDC_DEPTH_3                                 (0x2U << CANFD_CFDTXQCC_TXQDC_Pos)
#define    FL_CANFD_TXQDC_DEPTH_4                                 (0x3U << CANFD_CFDTXQCC_TXQDC_Pos)


#define    FL_CANFD_TXQIM_LAST_MESSAGE_TRANSMITTED                (0x0U << CANFD_CFDTXQCC_TXQIM_Pos)
#define    FL_CANFD_TXQIM_EVERY_TRANSMISSION                      (0x1U << CANFD_CFDTXQCC_TXQIM_Pos)


#define    FL_CANFD_THLIM_REACH_3P4_DEPTH                         (0x0U << CANFD_CFDTHLCC_THLIM_Pos)
#define    FL_CANFD_THLIM_EVERY_TRANSMISSION                      (0x1U << CANFD_CFDTHLCC_THLIM_Pos)


#define    FL_CANFD_BT_TX_MB                                      (0x1U << CANFD_CFDTHLACC0_BT_Pos)
#define    FL_CANFD_BT_TX_FIFO                                    (0x2U << CANFD_CFDTHLACC0_BT_Pos)
#define    FL_CANFD_BT_TX_QUEUE                                   (0x4U << CANFD_CFDTHLACC0_BT_Pos)

#define    FL_CANFD_SRST_NO_RESET                                 (0x0U << CANFD_CFDGRSTC_SRST_Pos)
#define    FL_CANFD_SRST_RESET                                    (0x1U << CANFD_CFDGRSTC_SRST_Pos)


#define    FL_CANFD_TSCCFG_SOF                                    (0x0U << CANFD_CFDGFDCFG_TSCCFG_Pos)
#define    FL_CANFD_TSCCFG_FRAME_VALID_INDICATION                 (0x1U << CANFD_CFDGFDCFG_TSCCFG_Pos)
#define    FL_CANFD_TSCCFG_RES                                    (0x2U << CANFD_CFDGFDCFG_TSCCFG_Pos)


#define    FL_CANFD_GPFL_IDE_STANDARD                             (0x0U << CANFD_CFDGPFLIDs_GPFLIDE_Pos)
#define    FL_CANFD_GPFL_IDE_EXTENDED                             (0x1U << CANFD_CFDGPFLIDs_GPFLIDE_Pos)


#define    FL_CANFD_GPFL_RTR_DATA_FRAME                           (0x0U << CANFD_CFDGPFLIDs_GPFLRTR_Pos)
#define    FL_CANFD_GPFL_RTR_REMOTE_FRAME                         (0x1U << CANFD_CFDGPFLIDs_GPFLRTR_Pos)


#define    FL_CANFD_GPFL_LB_RX                                    (0x0U << CANFD_CFDGPFLIDs_GPFLLB_Pos)
#define    FL_CANFD_GPFL_LB_TX                                    (0x1U << CANFD_CFDGPFLIDs_GPFLLB_Pos)


#define    FL_CANFD_GPFL_IDEM_NOT_CONSIDERED                      (0x0U << CANFD_CFDGPFLMs_GPFLIDEM_Pos)
#define    FL_CANFD_GPFL_IDEM_CONSIDERED                          (0x1U << CANFD_CFDGPFLMs_GPFLIDEM_Pos)


#define    FL_CANFD_GPFL_RTRM_NOT_CONSIDERED                      (0x0U << CANFD_CFDGPFLMs_GPFLRTRM_Pos)
#define    FL_CANFD_GPFL_RTRM_CONSIDERED                          (0x1U << CANFD_CFDGPFLMs_GPFLRTRM_Pos)


#define    FL_CANFD_GPFL_INFO_LABEL1_0                            (0x0U << CANFD_CFDGPFLMs_GPFLIFL1_Pos)
#define    FL_CANFD_GPFL_INFO_LABEL1_1                            (0x1U << CANFD_CFDGPFLMs_GPFLIFL1_Pos)


