zmzdh/CAN_st_test/Drivers/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_canfd.h
/**
  * @brief    Set Global Interval Timer Reference Clock Prescaler
  * @rmtoll   CFDGCFG    ITRCP    FL_CANFD_Global_WriteIntervalTimerReferenceClockPrescaler
  * @param    CANFDx CANFD instance
  * @param    psc 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteIntervalTimerReferenceClockPrescaler(CANFD_COMMON_Type* CANFDx, uint32_t psc)
{
    MODIFY_REG(CANFDx->CFDGCFG, (0xffffU << 16U), (psc << 16U));
}

/**
  * @brief    Set Global Timestamp Source
  * @rmtoll   CFDGCFG    TSSS    FL_CANFD_Global_SetTimestampSource
  * @param    CANFDx CANFD instance
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TSSS_CLOCK_PERIPHERAL
  *           @arg @ref FL_CANFD_TSSS_CLOCK_BIT_TIME
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetTimestampSource(CANFD_COMMON_Type* CANFDx, uint32_t clock)
{
    MODIFY_REG(CANFDx->CFDGCFG, CANFD_CFDGCFG_TSSS_Msk, clock);
}

/**
  * @brief    Get Global Timestamp Source
  * @rmtoll   CFDGCFG    TSSS    FL_CANFD_Global_GetTimestampSource
  * @param    CANFDx CANFD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_TSSS_CLOCK_PERIPHERAL
  *           @arg @ref FL_CANFD_TSSS_CLOCK_BIT_TIME
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetTimestampSource(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGCFG, CANFD_CFDGCFG_TSSS_Msk));
}

/**
  * @brief    Set Global Timestamp Prescaler
  * @rmtoll   CFDGCFG    TSP    FL_CANFD_Global_SetTimestampPrescaler
  * @param    CANFDx CANFD instance
  * @param    psc This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TSP_PSC_1
  *           @arg @ref FL_CANFD_TSP_PSC_2
  *           @arg @ref FL_CANFD_TSP_PSC_4
  *           @arg @ref FL_CANFD_TSP_PSC_8
  *           @arg @ref FL_CANFD_TSP_PSC_16
  *           @arg @ref FL_CANFD_TSP_PSC_32
  *           @arg @ref FL_CANFD_TSP_PSC_64
  *           @arg @ref FL_CANFD_TSP_PSC_128
  *           @arg @ref FL_CANFD_TSP_PSC_256
  *           @arg @ref FL_CANFD_TSP_PSC_512
  *           @arg @ref FL_CANFD_TSP_PSC_1024
  *           @arg @ref FL_CANFD_TSP_PSC_2048
  *           @arg @ref FL_CANFD_TSP_PSC_4096
  *           @arg @ref FL_CANFD_TSP_PSC_8192
  *           @arg @ref FL_CANFD_TSP_PSC_16384
  *           @arg @ref FL_CANFD_TSP_PSC_32768
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetTimestampPrescaler(CANFD_COMMON_Type* CANFDx, uint32_t psc)
{
    MODIFY_REG(CANFDx->CFDGCFG, CANFD_CFDGCFG_TSP_Msk, psc);
}

/**
  * @brief    Get Global Timestamp Prescaler
  * @rmtoll   CFDGCFG    TSP    FL_CANFD_Global_GetTimestampPrescaler
  * @param    CANFDx CANFD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_TSP_PSC_1
  *           @arg @ref FL_CANFD_TSP_PSC_2
  *           @arg @ref FL_CANFD_TSP_PSC_4
  *           @arg @ref FL_CANFD_TSP_PSC_8
  *           @arg @ref FL_CANFD_TSP_PSC_16
  *           @arg @ref FL_CANFD_TSP_PSC_32
  *           @arg @ref FL_CANFD_TSP_PSC_64
  *           @arg @ref FL_CANFD_TSP_PSC_128
  *           @arg @ref FL_CANFD_TSP_PSC_256
  *           @arg @ref FL_CANFD_TSP_PSC_512
  *           @arg @ref FL_CANFD_TSP_PSC_1024
  *           @arg @ref FL_CANFD_TSP_PSC_2048
  *           @arg @ref FL_CANFD_TSP_PSC_4096
  *           @arg @ref FL_CANFD_TSP_PSC_8192
  *           @arg @ref FL_CANFD_TSP_PSC_16384
  *           @arg @ref FL_CANFD_TSP_PSC_32768
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetTimestampPrescaler(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGCFG, CANFD_CFDGCFG_TSP_Msk));
}

/**
  * @brief    Set Global CAN-FD message Payload overflow configuration
  * @rmtoll   CFDGCFG    CMPOC    FL_CANFD_Global_SetCANFDMessagePayloadOverflowConfiguration
  * @param    CANFDx CANFD instance
  * @param    configuration This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_CMPOC_CONFIGURATION_REJECTED
  *           @arg @ref FL_CANFD_CMPOC_CONFIGURATION_CUTOFF
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetCANFDMessagePayloadOverflowConfiguration(CANFD_COMMON_Type* CANFDx, uint32_t configuration)
{
    MODIFY_REG(CANFDx->CFDGCFG, CANFD_CFDGCFG_CMPOC_Msk, configuration);
}

/**
  * @brief    Get Global CAN-FD message Payload overflow configuration
  * @rmtoll   CFDGCFG    CMPOC    FL_CANFD_Global_GetCANFDMessagePayloadOverflowConfiguration
  * @param    CANFDx CANFD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_CMPOC_CONFIGURATION_REJECTED
  *           @arg @ref FL_CANFD_CMPOC_CONFIGURATION_CUTOFF
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetCANFDMessagePayloadOverflowConfiguration(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGCFG, CANFD_CFDGCFG_CMPOC_Msk));
}

/**
  * @brief    Set Global Data Link Controller Clock Select
  * @rmtoll   CFDGCFG    DCS    FL_CANFD_Global_SetDataLinkControllerClock
  * @param    CANFDx CANFD instance
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_DCS_CLOCK_INTERNAL
  *           @arg @ref FL_CANFD_DCS_CLOCK_EXTRENAL
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetDataLinkControllerClock(CANFD_COMMON_Type* CANFDx, uint32_t clock)
{
    MODIFY_REG(CANFDx->CFDGCFG, CANFD_CFDGCFG_DCS_Msk, clock);
}

/**
  * @brief    Get Global Data Link Controller Clock Select
  * @rmtoll   CFDGCFG    DCS    FL_CANFD_Global_GetDataLinkControllerClock
  * @param    CANFDx CANFD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_DCS_CLOCK_INTERNAL
  *           @arg @ref FL_CANFD_DCS_CLOCK_EXTRENAL
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetDataLinkControllerClock(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGCFG, CANFD_CFDGCFG_DCS_Msk));
}

/**
  * @brief    Global Mirror Mode Enable
  * @rmtoll   CFDGCFG    MME    FL_CANFD_Global_Enable_MirrorMode
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Enable_MirrorMode(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDGCFG, CANFD_CFDGCFG_MME_Msk);
}

/**
  * @brief    Global Mirror Mode disable 
  * @rmtoll   CFDGCFG    MME    FL_CANFD_Global_Disable_MirrorMode
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Disable_MirrorMode(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDGCFG, CANFD_CFDGCFG_MME_Msk);
}

/**
  * @brief    Global Mirror Mode enable status
  * @rmtoll   CFDGCFG    MME    FL_CANFD_Global_IsEnabled_MirrorMode
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsEnabled_MirrorMode(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGCFG, CANFD_CFDGCFG_MME_Msk) == CANFD_CFDGCFG_MME_Msk);
}

/**
  * @brief    Global DLC Replacement Enable
  * @rmtoll   CFDGCFG    DRE    FL_CANFD_Global_Enable_DLCReplacement
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Enable_DLCReplacement(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDGCFG, CANFD_CFDGCFG_DRE_Msk);
}

/**
  * @brief    Global DLC Replacement disable 
  * @rmtoll   CFDGCFG    DRE    FL_CANFD_Global_Disable_DLCReplacement
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Disable_DLCReplacement(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDGCFG, CANFD_CFDGCFG_DRE_Msk);
}

/**
  * @brief    Global DLC Replacement enable status
  * @rmtoll   CFDGCFG    DRE    FL_CANFD_Global_IsEnabled_DLCReplacement
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsEnabled_DLCReplacement(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGCFG, CANFD_CFDGCFG_DRE_Msk) == CANFD_CFDGCFG_DRE_Msk);
}

/**
  * @brief    Global DLC Check Enable
  * @rmtoll   CFDGCFG    DCE    FL_CANFD_Global_Enable_DLCCheck
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Enable_DLCCheck(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDGCFG, CANFD_CFDGCFG_DCE_Msk);
}

/**
  * @brief    Global DLC Check disable 
  * @rmtoll   CFDGCFG    DCE    FL_CANFD_Global_Disable_DLCCheck
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Disable_DLCCheck(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDGCFG, CANFD_CFDGCFG_DCE_Msk);
}

/**
  * @brief    Global DLC Check enable status
  * @rmtoll   CFDGCFG    DCE    FL_CANFD_Global_IsEnabled_DLCCheck
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsEnabled_DLCCheck(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGCFG, CANFD_CFDGCFG_DCE_Msk) == CANFD_CFDGCFG_DCE_Msk);
}

/**
  * @brief    Set Global Transmission Priority
  * @rmtoll   CFDGCFG    TPRI    FL_CANFD_Global_SetTxPriority
  * @param    CANFDx CANFD instance
  * @param    priority This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TX_PRIORITY_ID
  *           @arg @ref FL_CANFD_TX_PRIORITY_BUFFER
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetTxPriority(CANFD_COMMON_Type* CANFDx, uint32_t priority)
{
    MODIFY_REG(CANFDx->CFDGCFG, CANFD_CFDGCFG_TPRI_Msk, priority);
}

/**
  * @brief    Get Global Transmission Priority
  * @rmtoll   CFDGCFG    TPRI    FL_CANFD_Global_GetTxPriority
  * @param    CANFDx CANFD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_TX_PRIORITY_ID
  *           @arg @ref FL_CANFD_TX_PRIORITY_BUFFER
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetTxPriority(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGCFG, CANFD_CFDGCFG_TPRI_Msk));
}

/**
  * @brief    Set Global Timestamp Reset
  * @rmtoll   CFDGCTR    TSRST    FL_CANFD_Global_SetTimestampReset
  * @param    CANFDx CANFD instance
  * @param    reset This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_TS_RST_NO_RESET
  *           @arg @ref FL_CANFD_TS_RST_RESET
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetTimestampReset(CANFD_COMMON_Type* CANFDx, uint32_t reset)
{
    MODIFY_REG(CANFDx->CFDGCTR, CANFD_CFDGCTR_TSRST_Msk, reset);
}

/**
  * @brief    Get Global Timestamp Reset
  * @rmtoll   CFDGCTR    TSRST    FL_CANFD_Global_GetTimestampReset
  * @param    CANFDx CANFD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_TS_RST_NO_RESET
  *           @arg @ref FL_CANFD_TS_RST_RESET
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetTimestampReset(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGCTR, CANFD_CFDGCTR_TSRST_Msk));
}

/**
  * @brief    Global CAN-FD message payload overflow Flag Interrupt enable 
  * @rmtoll   CFDGCTR    CMPOFIE    FL_CANFD_Global_EnableIT_CANFDMessagePayloadOverflow
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_EnableIT_CANFDMessagePayloadOverflow(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDGCTR, CANFD_CFDGCTR_CMPOFIE_Msk);
}

/**
  * @brief    Global CAN-FD message payload overflow Flag Interrupt enable status 
  * @rmtoll   CFDGCTR    CMPOFIE    FL_CANFD_Global_IsEnabledIT_CANFDMessagePayloadOverflow
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsEnabledIT_CANFDMessagePayloadOverflow(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGCTR, CANFD_CFDGCTR_CMPOFIE_Msk) == CANFD_CFDGCTR_CMPOFIE_Msk);
}

/**
  * @brief    Global CAN-FD message payload overflow Flag Interrupt disable 
  * @rmtoll   CFDGCTR    CMPOFIE    FL_CANFD_Global_DisableIT_CANFDMessagePayloadOverflow
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_DisableIT_CANFDMessagePayloadOverflow(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDGCTR, CANFD_CFDGCTR_CMPOFIE_Msk);
}

/**
  * @brief    Global TX History List Entry Lost  Interrupt enable 
  * @rmtoll   CFDGCTR    THLEIE    FL_CANFD_Global_EnableIT_TxHistoryListEntryLost
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_EnableIT_TxHistoryListEntryLost(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDGCTR, CANFD_CFDGCTR_THLEIE_Msk);
}

/**
  * @brief    Global TX History List Entry Lost Interrupt enable status 
  * @rmtoll   CFDGCTR    THLEIE    FL_CANFD_Global_IsEnabledIT_TxHistoryListEntryLost
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsEnabledIT_TxHistoryListEntryLost(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGCTR, CANFD_CFDGCTR_THLEIE_Msk) == CANFD_CFDGCTR_THLEIE_Msk);
}

/**
  * @brief    Global TX History List Entry Lost Interrupt disable 
  * @rmtoll   CFDGCTR    THLEIE    FL_CANFD_Global_DisableIT_TxHistoryListEntryLost
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_DisableIT_TxHistoryListEntryLost(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDGCTR, CANFD_CFDGCTR_THLEIE_Msk);
}

/**
  * @brief    Global Message lost Error  Interrupt enable 
  * @rmtoll   CFDGCTR    MEIE    FL_CANFD_Global_EnableIT_MessageLostError
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_EnableIT_MessageLostError(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDGCTR, CANFD_CFDGCTR_MEIE_Msk);
}

/**
  * @brief    Global Message lost Error  Interrupt enable status 
  * @rmtoll   CFDGCTR    MEIE    FL_CANFD_Global_IsEnabledIT_MessageLostError
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsEnabledIT_MessageLostError(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGCTR, CANFD_CFDGCTR_MEIE_Msk) == CANFD_CFDGCTR_MEIE_Msk);
}

/**
  * @brief    Global Message lost Error  Interrupt disable 
  * @rmtoll   CFDGCTR    MEIE    FL_CANFD_Global_DisableIT_MessageLostError
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_DisableIT_MessageLostError(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDGCTR, CANFD_CFDGCTR_MEIE_Msk);
}

/**
  * @brief    Global DLC check  Interrupt enable 
  * @rmtoll   CFDGCTR    DEIE    FL_CANFD_Global_EnableIT_DLCCheck
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_EnableIT_DLCCheck(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDGCTR, CANFD_CFDGCTR_DEIE_Msk);
}

/**
  * @brief    Global DLC check  Interrupt enable status 
  * @rmtoll   CFDGCTR    DEIE    FL_CANFD_Global_IsEnabledIT_DLCCheck
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsEnabledIT_DLCCheck(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGCTR, CANFD_CFDGCTR_DEIE_Msk) == CANFD_CFDGCTR_DEIE_Msk);
}

/**
  * @brief    Global DLC check  Interrupt disable 
  * @rmtoll   CFDGCTR    DEIE    FL_CANFD_Global_DisableIT_DLCCheck
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_DisableIT_DLCCheck(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDGCTR, CANFD_CFDGCTR_DEIE_Msk);
}

/**
  * @brief    Global Sleep enable 
  * @rmtoll   CFDGCTR    GSLPR    FL_CANFD_Global_Enable_Sleep
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Enable_Sleep(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDGCTR, CANFD_CFDGCTR_GSLPR_Msk);
}

/**
  * @brief    Global Sleep enable status 
  * @rmtoll   CFDGCTR    GSLPR    FL_CANFD_Global_IsEnabled_Sleep
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsEnabled_Sleep(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGCTR, CANFD_CFDGCTR_GSLPR_Msk) == CANFD_CFDGCTR_GSLPR_Msk);
}

/**
  * @brief    Global Sleep disable 
  * @rmtoll   CFDGCTR    GSLPR    FL_CANFD_Global_Disable_Sleep
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Disable_Sleep(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDGCTR, CANFD_CFDGCTR_GSLPR_Msk);
}

/**
  * @brief    Set Global Mode
  * @rmtoll   CFDGCTR    GMDC    FL_CANFD_Global_SetGlobalMode
  * @param    CANFDx CANFD instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_GLOBAL_MODE_OPERATION
  *           @arg @ref FL_CANFD_GLOBAL_MODE_RESET
  *           @arg @ref FL_CANFD_GLOBAL_MODE_HALT
  *           @arg @ref FL_CANFD_GLOBAL_MODE_KEEP_CURRENT
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetGlobalMode(CANFD_COMMON_Type* CANFDx, uint32_t mode)
{
    MODIFY_REG(CANFDx->CFDGCTR, CANFD_CFDGCTR_GMDC_Msk, mode);
}

/**
  * @brief    Get Global Mode
  * @rmtoll   CFDGCTR    GMDC    FL_CANFD_Global_GetGlobalMode
  * @param    CANFDx CANFD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_GLOBAL_MODE_OPERATION
  *           @arg @ref FL_CANFD_GLOBAL_MODE_RESET
  *           @arg @ref FL_CANFD_GLOBAL_MODE_HALT
  *           @arg @ref FL_CANFD_GLOBAL_MODE_KEEP_CURRENT
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetGlobalMode(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGCTR, CANFD_CFDGCTR_GMDC_Msk));
}

/**
  * @brief    Get Global RAM Initialisation
  * @rmtoll   CFDGSTS    GRAMINIT    FL_CANFD_Global_IsActiveFlag_GlobalRAMInitialisation
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_GlobalRAMInitialisation(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGSTS, CANFD_CFDGSTS_GRAMINIT_Msk) == (CANFD_CFDGSTS_GRAMINIT_Msk));
}

/**
  * @brief    Get Global SLEEP Status
  * @rmtoll   CFDGSTS    GSLPSTS    FL_CANFD_Global_IsActiveFlag_GlobalSleepStatus
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_GlobalSleepStatus(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGSTS, CANFD_CFDGSTS_GSLPSTS_Msk) == (CANFD_CFDGSTS_GSLPSTS_Msk));
}

/**
  * @brief    Get Global HALT Status
  * @rmtoll   CFDGSTS    GHLTSTS    FL_CANFD_Global_IsActiveFlag_GlobalHaltStatus
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_GlobalHaltStatus(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGSTS, CANFD_CFDGSTS_GHLTSTS_Msk) == (CANFD_CFDGSTS_GHLTSTS_Msk));
}

/**
  * @brief    Get Global RESET Status
  * @rmtoll   CFDGSTS    GRSTSTS    FL_CANFD_Global_IsActiveFlag_GlobalResetStatus
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_GlobalResetStatus(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGSTS, CANFD_CFDGSTS_GRSTSTS_Msk) == (CANFD_CFDGSTS_GRSTSTS_Msk));
}

/**
  * @brief    Get Global ECC Error Flag
  * @rmtoll   CFDGERFL    EEF    FL_CANFD_Global_IsActiveFlag_ECCError
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_ECCError(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGERFL, CANFD_CFDGERFL_EEF_Msk) == (CANFD_CFDGERFL_EEF_Msk));
}

/**
  * @brief    Clear Global ECC Error Flag
  * @rmtoll   CFDGERFL    EEF    FL_CANFD_Global_ClearFlag_ECCError
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_ClearFlag_ECCError(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDGERFL, CANFD_CFDGERFL_EEF_Msk);
}

/**
  * @brief    Get Global CAN-FD message payload overflow Flag
  * @rmtoll   CFDGERFL    CMPOF    FL_CANFD_Global_IsActiveFlag_CANFDMessagePayloadOverflow
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_CANFDMessagePayloadOverflow(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGERFL, CANFD_CFDGERFL_CMPOF_Msk) == (CANFD_CFDGERFL_CMPOF_Msk));
}

/**
  * @brief    Clear Global CAN-FD message payload overflow Flag
  * @rmtoll   CFDGERFL    CMPOF    FL_CANFD_Global_ClearFlag_CANFDMessagePayloadOverflow
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_ClearFlag_CANFDMessagePayloadOverflow(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDGERFL, CANFD_CFDGERFL_CMPOF_Msk);
}

/**
  * @brief    Get Global TX History List Entry Lost Error Status Flag
  * @rmtoll   CFDGERFL    THLES    FL_CANFD_Global_IsActiveFlag_TxHistoryListEntryLostErrorStatus
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_TxHistoryListEntryLostErrorStatus(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGERFL, CANFD_CFDGERFL_THLES_Msk) == (CANFD_CFDGERFL_THLES_Msk));
}

/**
  * @brief    Get Global Message Lost Error Status
  * @rmtoll   CFDGERFL    MES    FL_CANFD_Global_IsActiveFlag_MessageLostErrorStatus
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_MessageLostErrorStatus(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGERFL, CANFD_CFDGERFL_MES_Msk) == (CANFD_CFDGERFL_MES_Msk));
}

/**
  * @brief    Get Global DLC Error Flag
  * @rmtoll   CFDGERFL    DEF    FL_CANFD_Global_IsActiveFlag_DLCError
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_DLCError(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGERFL, CANFD_CFDGERFL_DEF_Msk) == (CANFD_CFDGERFL_DEF_Msk));
}

/**
  * @brief    Clear Global DLC Error Flag
  * @rmtoll   CFDGERFL    DEF    FL_CANFD_Global_ClearFlag_DLCError
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_ClearFlag_DLCError(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDGERFL, CANFD_CFDGERFL_DEF_Msk);
}

/**
  * @brief    Get Global TX History List Interrupt Flag
  * @rmtoll   CFDGTINTSTS    THIF    FL_CANFD_Global_IsActiveFlag_TxHistoryList
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_TxHistoryList(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGTINTSTS, CANFD_CFDGTINTSTS_THIF_Msk) == (CANFD_CFDGTINTSTS_THIF_Msk));
}

/**
  * @brief    Get Global Common FIFO TX Mode Interrupt Flag
  * @rmtoll   CFDGTINTSTS    CFTIF    FL_CANFD_Global_IsActiveFlag_CommonFIFOTxMode
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_CommonFIFOTxMode(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGTINTSTS, CANFD_CFDGTINTSTS_CFTIF_Msk) == (CANFD_CFDGTINTSTS_CFTIF_Msk));
}

/**
  * @brief    Get Global TX Queue Interrupt Flag
  * @rmtoll   CFDGTINTSTS    TQIF    FL_CANFD_Global_IsActiveFlag_TxQueue
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_TxQueue(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGTINTSTS, CANFD_CFDGTINTSTS_TQIF_Msk) == (CANFD_CFDGTINTSTS_TQIF_Msk));
}

