zmzdh/CAN_st_test/Drivers/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_canfd.h
/**
  * @brief    Get Global TX Abort Interrupt Flag
  * @rmtoll   CFDGTINTSTS    TAIF    FL_CANFD_Global_IsActiveFlag_TxAbort
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_TxAbort(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGTINTSTS, CANFD_CFDGTINTSTS_TAIF_Msk) == (CANFD_CFDGTINTSTS_TAIF_Msk));
}

/**
  * @brief    Get Global TX Successful Interrupt Flag
  * @rmtoll   CFDGTINTSTS    TSIF    FL_CANFD_Global_IsActiveFlag_TxSuccessful
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_TxSuccessful(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGTINTSTS, CANFD_CFDGTINTSTS_TSIF_Msk) == (CANFD_CFDGTINTSTS_TSIF_Msk));
}

/**
  * @brief    Get Global Timestamp Value
  * @rmtoll   CFDGTSC    TS    FL_CANFD_Global_FD_ReadTimestampValue
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_FD_ReadTimestampValue(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGTSC, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Global Acceptance Filter List Data Access enable 
  * @rmtoll   CFDGAFLECTR    AFLDAE    FL_CANFD_Global_Enable_GAFLDataAccess
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Enable_GAFLDataAccess(CANFD_COMMON_Type* CANFDx)
{
    SET_BIT(CANFDx->CFDGAFLECTR, CANFD_CFDGAFLECTR_AFLDAE_Msk);
}

/**
  * @brief    Global Acceptance Filter List Data Access enable status 
  * @rmtoll   CFDGAFLECTR    AFLDAE    FL_CANFD_Global_IsEnabled_GAFLDataAccess
  * @param    CANFDx CANFD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsEnabled_GAFLDataAccess(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGAFLECTR, CANFD_CFDGAFLECTR_AFLDAE_Msk) == CANFD_CFDGAFLECTR_AFLDAE_Msk);
}

/**
  * @brief    Global Acceptance Filter List Data Access disable 
  * @rmtoll   CFDGAFLECTR    AFLDAE    FL_CANFD_Global_Disable_GAFLDataAccess
  * @param    CANFDx CANFD instance
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Disable_GAFLDataAccess(CANFD_COMMON_Type* CANFDx)
{
    CLEAR_BIT(CANFDx->CFDGAFLECTR, CANFD_CFDGAFLECTR_AFLDAE_Msk);
}

/**
  * @brief    Set Global Acceptance Filter List Page Number
  * @rmtoll   CFDGAFLECTR    AFLPN    FL_CANFD_Global_SetGAFLPageNumber
  * @param    CANFDx CANFD instance
  * @param    page This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_GAFL_PAGE_NUMBER_FIRST
  *           @arg @ref FL_CANFD_GAFL_PAGE_NUMBER_SECOND
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetGAFLPageNumber(CANFD_COMMON_Type* CANFDx, uint32_t page)
{
    MODIFY_REG(CANFDx->CFDGAFLECTR, CANFD_CFDGAFLECTR_AFLPN_Msk, page);
}

/**
  * @brief    Get Global Acceptance Filter List Page Number
  * @rmtoll   CFDGAFLECTR    AFLPN    FL_CANFD_Global_GetGAFLPageNumber
  * @param    CANFDx CANFD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_GAFL_PAGE_NUMBER_FIRST
  *           @arg @ref FL_CANFD_GAFL_PAGE_NUMBER_SECOND
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetGAFLPageNumber(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGAFLECTR, CANFD_CFDGAFLECTR_AFLPN_Msk));
}

/**
  * @brief    Set Global Acceptance Filter List Rule Number
  * @rmtoll   CFDGAFLCFG    RNC    FL_CANFD_Global_WriteGAFLRuleNumber
  * @param    CANFDx CANFD instance
  * @param    number 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteGAFLRuleNumber(CANFD_COMMON_Type* CANFDx, uint32_t number)
{
    MODIFY_REG(CANFDx->CFDGAFLCFG, (0x3fU << 16U), (number << 16U));
}

/**
  * @brief    Get Global Acceptance Filter List Rule Number
  * @rmtoll   CFDGAFLCFG    RNC    FL_CANFD_Global_ReadGAFLRuleNumber
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadGAFLRuleNumber(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGAFLCFG, (0x3fU << 16U)) >> 16U);
}

/**
  * @brief    Set Global Acceptance Filter List Entry IDE Field
  * @rmtoll   CFDGAFLIDr    GAFLIDE    FL_CANFD_Global_SetGAFLIDE
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_AFL_FILTER0
  *           @arg @ref FL_CANFD_AFL_FILTER1
  *           @arg @ref FL_CANFD_AFL_FILTER2
  *           @arg @ref FL_CANFD_AFL_FILTER3
  *           @arg @ref FL_CANFD_AFL_FILTER4
  *           @arg @ref FL_CANFD_AFL_FILTER5
  *           @arg @ref FL_CANFD_AFL_FILTER6
  *           @arg @ref FL_CANFD_AFL_FILTER7
  *           @arg @ref FL_CANFD_AFL_FILTER8
  *           @arg @ref FL_CANFD_AFL_FILTER9
  *           @arg @ref FL_CANFD_AFL_FILTER10
  *           @arg @ref FL_CANFD_AFL_FILTER11
  *           @arg @ref FL_CANFD_AFL_FILTER12
  *           @arg @ref FL_CANFD_AFL_FILTER13
  *           @arg @ref FL_CANFD_AFL_FILTER14
  *           @arg @ref FL_CANFD_AFL_FILTER15
  * @param    ide This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_GAFL_IDE_STANDARD
  *           @arg @ref FL_CANFD_GAFL_IDE_EXTENDED
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetGAFLIDE(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t ide)
{
    MODIFY_REG(CANFDx->CFDGAFL[filterX].CFDGAFLIDr, CANFD_CFDGAFLIDr_GAFLIDE_Msk, ide);
}

/**
  * @brief    Get Global Acceptance Filter List Entry IDE Field
  * @rmtoll   CFDGAFLIDr    GAFLIDE    FL_CANFD_Global_GetGAFLIDE
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_AFL_FILTER0
  *           @arg @ref FL_CANFD_AFL_FILTER1
  *           @arg @ref FL_CANFD_AFL_FILTER2
  *           @arg @ref FL_CANFD_AFL_FILTER3
  *           @arg @ref FL_CANFD_AFL_FILTER4
  *           @arg @ref FL_CANFD_AFL_FILTER5
  *           @arg @ref FL_CANFD_AFL_FILTER6
  *           @arg @ref FL_CANFD_AFL_FILTER7
  *           @arg @ref FL_CANFD_AFL_FILTER8
  *           @arg @ref FL_CANFD_AFL_FILTER9
  *           @arg @ref FL_CANFD_AFL_FILTER10
  *           @arg @ref FL_CANFD_AFL_FILTER11
  *           @arg @ref FL_CANFD_AFL_FILTER12
  *           @arg @ref FL_CANFD_AFL_FILTER13
  *           @arg @ref FL_CANFD_AFL_FILTER14
  *           @arg @ref FL_CANFD_AFL_FILTER15
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_GAFL_IDE_STANDARD
  *           @arg @ref FL_CANFD_GAFL_IDE_EXTENDED
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetGAFLIDE(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGAFL[filterX].CFDGAFLIDr, CANFD_CFDGAFLIDr_GAFLIDE_Msk));
}

/**
  * @brief    Set Global Acceptance Filter List Entry RTR Field
  * @rmtoll   CFDGAFLIDr    GAFLRTR    FL_CANFD_Global_SetGAFLRTR
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_AFL_FILTER0
  *           @arg @ref FL_CANFD_AFL_FILTER1
  *           @arg @ref FL_CANFD_AFL_FILTER2
  *           @arg @ref FL_CANFD_AFL_FILTER3
  *           @arg @ref FL_CANFD_AFL_FILTER4
  *           @arg @ref FL_CANFD_AFL_FILTER5
  *           @arg @ref FL_CANFD_AFL_FILTER6
  *           @arg @ref FL_CANFD_AFL_FILTER7
  *           @arg @ref FL_CANFD_AFL_FILTER8
  *           @arg @ref FL_CANFD_AFL_FILTER9
  *           @arg @ref FL_CANFD_AFL_FILTER10
  *           @arg @ref FL_CANFD_AFL_FILTER11
  *           @arg @ref FL_CANFD_AFL_FILTER12
  *           @arg @ref FL_CANFD_AFL_FILTER13
  *           @arg @ref FL_CANFD_AFL_FILTER14
  *           @arg @ref FL_CANFD_AFL_FILTER15
  * @param    rtr This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_GAFL_RTR_DATA_FRAME
  *           @arg @ref FL_CANFD_GAFL_RTR_REMOTE_FRAME
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetGAFLRTR(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t rtr)
{
    MODIFY_REG(CANFDx->CFDGAFL[filterX].CFDGAFLIDr, CANFD_CFDGAFLIDr_GAFLRTR_Msk, rtr);
}

/**
  * @brief    Get Global Acceptance Filter List Entry RTR Field
  * @rmtoll   CFDGAFLIDr    GAFLRTR    FL_CANFD_Global_GetGAFLRTR
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_AFL_FILTER0
  *           @arg @ref FL_CANFD_AFL_FILTER1
  *           @arg @ref FL_CANFD_AFL_FILTER2
  *           @arg @ref FL_CANFD_AFL_FILTER3
  *           @arg @ref FL_CANFD_AFL_FILTER4
  *           @arg @ref FL_CANFD_AFL_FILTER5
  *           @arg @ref FL_CANFD_AFL_FILTER6
  *           @arg @ref FL_CANFD_AFL_FILTER7
  *           @arg @ref FL_CANFD_AFL_FILTER8
  *           @arg @ref FL_CANFD_AFL_FILTER9
  *           @arg @ref FL_CANFD_AFL_FILTER10
  *           @arg @ref FL_CANFD_AFL_FILTER11
  *           @arg @ref FL_CANFD_AFL_FILTER12
  *           @arg @ref FL_CANFD_AFL_FILTER13
  *           @arg @ref FL_CANFD_AFL_FILTER14
  *           @arg @ref FL_CANFD_AFL_FILTER15
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_GAFL_RTR_DATA_FRAME
  *           @arg @ref FL_CANFD_GAFL_RTR_REMOTE_FRAME
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetGAFLRTR(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGAFL[filterX].CFDGAFLIDr, CANFD_CFDGAFLIDr_GAFLRTR_Msk));
}

/**
  * @brief    Set Global Acceptance Filter List Entry Loopback Configuration
  * @rmtoll   CFDGAFLIDr    GAFLLB    FL_CANFD_Global_SetGAFLoopback
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_AFL_FILTER0
  *           @arg @ref FL_CANFD_AFL_FILTER1
  *           @arg @ref FL_CANFD_AFL_FILTER2
  *           @arg @ref FL_CANFD_AFL_FILTER3
  *           @arg @ref FL_CANFD_AFL_FILTER4
  *           @arg @ref FL_CANFD_AFL_FILTER5
  *           @arg @ref FL_CANFD_AFL_FILTER6
  *           @arg @ref FL_CANFD_AFL_FILTER7
  *           @arg @ref FL_CANFD_AFL_FILTER8
  *           @arg @ref FL_CANFD_AFL_FILTER9
  *           @arg @ref FL_CANFD_AFL_FILTER10
  *           @arg @ref FL_CANFD_AFL_FILTER11
  *           @arg @ref FL_CANFD_AFL_FILTER12
  *           @arg @ref FL_CANFD_AFL_FILTER13
  *           @arg @ref FL_CANFD_AFL_FILTER14
  *           @arg @ref FL_CANFD_AFL_FILTER15
  * @param    loopback This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_GAFL_LB_RX
  *           @arg @ref FL_CANFD_GAFL_LB_TX
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetGAFLoopback(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t loopback)
{
    MODIFY_REG(CANFDx->CFDGAFL[filterX].CFDGAFLIDr, CANFD_CFDGAFLIDr_GAFLLB_Msk, loopback);
}

/**
  * @brief    Get Global Acceptance Filter List Entry Loopback Configuration
  * @rmtoll   CFDGAFLIDr    GAFLLB    FL_CANFD_Global_GetGAFLoopback
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_AFL_FILTER0
  *           @arg @ref FL_CANFD_AFL_FILTER1
  *           @arg @ref FL_CANFD_AFL_FILTER2
  *           @arg @ref FL_CANFD_AFL_FILTER3
  *           @arg @ref FL_CANFD_AFL_FILTER4
  *           @arg @ref FL_CANFD_AFL_FILTER5
  *           @arg @ref FL_CANFD_AFL_FILTER6
  *           @arg @ref FL_CANFD_AFL_FILTER7
  *           @arg @ref FL_CANFD_AFL_FILTER8
  *           @arg @ref FL_CANFD_AFL_FILTER9
  *           @arg @ref FL_CANFD_AFL_FILTER10
  *           @arg @ref FL_CANFD_AFL_FILTER11
  *           @arg @ref FL_CANFD_AFL_FILTER12
  *           @arg @ref FL_CANFD_AFL_FILTER13
  *           @arg @ref FL_CANFD_AFL_FILTER14
  *           @arg @ref FL_CANFD_AFL_FILTER15
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_GAFL_LB_RX
  *           @arg @ref FL_CANFD_GAFL_LB_TX
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetGAFLoopback(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGAFL[filterX].CFDGAFLIDr, CANFD_CFDGAFLIDr_GAFLLB_Msk));
}

/**
  * @brief    Set Global Acceptance Filter List Entry ID Field
  * @rmtoll   CFDGAFLIDr    GAFLID    FL_CANFD_Global_WriteGAFLID
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_AFL_FILTER0
  *           @arg @ref FL_CANFD_AFL_FILTER1
  *           @arg @ref FL_CANFD_AFL_FILTER2
  *           @arg @ref FL_CANFD_AFL_FILTER3
  *           @arg @ref FL_CANFD_AFL_FILTER4
  *           @arg @ref FL_CANFD_AFL_FILTER5
  *           @arg @ref FL_CANFD_AFL_FILTER6
  *           @arg @ref FL_CANFD_AFL_FILTER7
  *           @arg @ref FL_CANFD_AFL_FILTER8
  *           @arg @ref FL_CANFD_AFL_FILTER9
  *           @arg @ref FL_CANFD_AFL_FILTER10
  *           @arg @ref FL_CANFD_AFL_FILTER11
  *           @arg @ref FL_CANFD_AFL_FILTER12
  *           @arg @ref FL_CANFD_AFL_FILTER13
  *           @arg @ref FL_CANFD_AFL_FILTER14
  *           @arg @ref FL_CANFD_AFL_FILTER15
  * @param    id 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteGAFLID(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t id)
{
    MODIFY_REG(CANFDx->CFDGAFL[filterX].CFDGAFLIDr, (0x1fffffffU << 0U), (id << 0U));
}

/**
  * @brief    Get Global Acceptance Filter List Entry ID Field
  * @rmtoll   CFDGAFLIDr    GAFLID    FL_CANFD_Global_ReadGAFLID
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_AFL_FILTER0
  *           @arg @ref FL_CANFD_AFL_FILTER1
  *           @arg @ref FL_CANFD_AFL_FILTER2
  *           @arg @ref FL_CANFD_AFL_FILTER3
  *           @arg @ref FL_CANFD_AFL_FILTER4
  *           @arg @ref FL_CANFD_AFL_FILTER5
  *           @arg @ref FL_CANFD_AFL_FILTER6
  *           @arg @ref FL_CANFD_AFL_FILTER7
  *           @arg @ref FL_CANFD_AFL_FILTER8
  *           @arg @ref FL_CANFD_AFL_FILTER9
  *           @arg @ref FL_CANFD_AFL_FILTER10
  *           @arg @ref FL_CANFD_AFL_FILTER11
  *           @arg @ref FL_CANFD_AFL_FILTER12
  *           @arg @ref FL_CANFD_AFL_FILTER13
  *           @arg @ref FL_CANFD_AFL_FILTER14
  *           @arg @ref FL_CANFD_AFL_FILTER15
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadGAFLID(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGAFL[filterX].CFDGAFLIDr, (0x1fffffffU << 0U)) >> 0U);
}

/**
  * @brief    Set Global Acceptance Filter List Entry IDE Mask
  * @rmtoll   CFDGAFLMr    GAFLIDEM    FL_CANFD_Global_SetGAFLIDEMask
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_AFL_FILTER0
  *           @arg @ref FL_CANFD_AFL_FILTER1
  *           @arg @ref FL_CANFD_AFL_FILTER2
  *           @arg @ref FL_CANFD_AFL_FILTER3
  *           @arg @ref FL_CANFD_AFL_FILTER4
  *           @arg @ref FL_CANFD_AFL_FILTER5
  *           @arg @ref FL_CANFD_AFL_FILTER6
  *           @arg @ref FL_CANFD_AFL_FILTER7
  *           @arg @ref FL_CANFD_AFL_FILTER8
  *           @arg @ref FL_CANFD_AFL_FILTER9
  *           @arg @ref FL_CANFD_AFL_FILTER10
  *           @arg @ref FL_CANFD_AFL_FILTER11
  *           @arg @ref FL_CANFD_AFL_FILTER12
  *           @arg @ref FL_CANFD_AFL_FILTER13
  *           @arg @ref FL_CANFD_AFL_FILTER14
  *           @arg @ref FL_CANFD_AFL_FILTER15
  * @param    idem This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_GAFL_IDEM_NOT_CONSIDERED
  *           @arg @ref FL_CANFD_GAFL_IDEM_CONSIDERED
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetGAFLIDEMask(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t idem)
{
    MODIFY_REG(CANFDx->CFDGAFL[filterX].CFDGAFLMr, CANFD_CFDGAFLMr_GAFLIDEM_Msk, idem);
}

/**
  * @brief    Get Global Acceptance Filter List Entry IDE Mask
  * @rmtoll   CFDGAFLMr    GAFLIDEM    FL_CANFD_Global_GetGAFLIDEMask
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_AFL_FILTER0
  *           @arg @ref FL_CANFD_AFL_FILTER1
  *           @arg @ref FL_CANFD_AFL_FILTER2
  *           @arg @ref FL_CANFD_AFL_FILTER3
  *           @arg @ref FL_CANFD_AFL_FILTER4
  *           @arg @ref FL_CANFD_AFL_FILTER5
  *           @arg @ref FL_CANFD_AFL_FILTER6
  *           @arg @ref FL_CANFD_AFL_FILTER7
  *           @arg @ref FL_CANFD_AFL_FILTER8
  *           @arg @ref FL_CANFD_AFL_FILTER9
  *           @arg @ref FL_CANFD_AFL_FILTER10
  *           @arg @ref FL_CANFD_AFL_FILTER11
  *           @arg @ref FL_CANFD_AFL_FILTER12
  *           @arg @ref FL_CANFD_AFL_FILTER13
  *           @arg @ref FL_CANFD_AFL_FILTER14
  *           @arg @ref FL_CANFD_AFL_FILTER15
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_GAFL_IDEM_NOT_CONSIDERED
  *           @arg @ref FL_CANFD_GAFL_IDEM_CONSIDERED
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetGAFLIDEMask(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGAFL[filterX].CFDGAFLMr, CANFD_CFDGAFLMr_GAFLIDEM_Msk));
}

/**
  * @brief    Set Global Acceptance Filter List Entry RTR Mask
  * @rmtoll   CFDGAFLMr    GAFLRTRM    FL_CANFD_Global_SetGAFLRTRMask
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_AFL_FILTER0
  *           @arg @ref FL_CANFD_AFL_FILTER1
  *           @arg @ref FL_CANFD_AFL_FILTER2
  *           @arg @ref FL_CANFD_AFL_FILTER3
  *           @arg @ref FL_CANFD_AFL_FILTER4
  *           @arg @ref FL_CANFD_AFL_FILTER5
  *           @arg @ref FL_CANFD_AFL_FILTER6
  *           @arg @ref FL_CANFD_AFL_FILTER7
  *           @arg @ref FL_CANFD_AFL_FILTER8
  *           @arg @ref FL_CANFD_AFL_FILTER9
  *           @arg @ref FL_CANFD_AFL_FILTER10
  *           @arg @ref FL_CANFD_AFL_FILTER11
  *           @arg @ref FL_CANFD_AFL_FILTER12
  *           @arg @ref FL_CANFD_AFL_FILTER13
  *           @arg @ref FL_CANFD_AFL_FILTER14
  *           @arg @ref FL_CANFD_AFL_FILTER15
  * @param    rtrm This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_GAFL_RTRM_NOT_CONSIDERED
  *           @arg @ref FL_CANFD_GAFL_RTRM_CONSIDERED
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetGAFLRTRMask(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t rtrm)
{
    MODIFY_REG(CANFDx->CFDGAFL[filterX].CFDGAFLMr, CANFD_CFDGAFLMr_GAFLRTRM_Msk, rtrm);
}

/**
  * @brief    Get Global Acceptance Filter List Entry RTR Mask
  * @rmtoll   CFDGAFLMr    GAFLRTRM    FL_CANFD_Global_GetGAFLRTRMask
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_AFL_FILTER0
  *           @arg @ref FL_CANFD_AFL_FILTER1
  *           @arg @ref FL_CANFD_AFL_FILTER2
  *           @arg @ref FL_CANFD_AFL_FILTER3
  *           @arg @ref FL_CANFD_AFL_FILTER4
  *           @arg @ref FL_CANFD_AFL_FILTER5
  *           @arg @ref FL_CANFD_AFL_FILTER6
  *           @arg @ref FL_CANFD_AFL_FILTER7
  *           @arg @ref FL_CANFD_AFL_FILTER8
  *           @arg @ref FL_CANFD_AFL_FILTER9
  *           @arg @ref FL_CANFD_AFL_FILTER10
  *           @arg @ref FL_CANFD_AFL_FILTER11
  *           @arg @ref FL_CANFD_AFL_FILTER12
  *           @arg @ref FL_CANFD_AFL_FILTER13
  *           @arg @ref FL_CANFD_AFL_FILTER14
  *           @arg @ref FL_CANFD_AFL_FILTER15
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_GAFL_RTRM_NOT_CONSIDERED
  *           @arg @ref FL_CANFD_GAFL_RTRM_CONSIDERED
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetGAFLRTRMask(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGAFL[filterX].CFDGAFLMr, CANFD_CFDGAFLMr_GAFLRTRM_Msk));
}

/**
  * @brief    Set Global Acceptance Filter List Information Label 1
  * @rmtoll   CFDGAFLMr    GAFLIFL1    FL_CANFD_Global_SetGAFLInfoLabel1
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_AFL_FILTER0
  *           @arg @ref FL_CANFD_AFL_FILTER1
  *           @arg @ref FL_CANFD_AFL_FILTER2
  *           @arg @ref FL_CANFD_AFL_FILTER3
  *           @arg @ref FL_CANFD_AFL_FILTER4
  *           @arg @ref FL_CANFD_AFL_FILTER5
  *           @arg @ref FL_CANFD_AFL_FILTER6
  *           @arg @ref FL_CANFD_AFL_FILTER7
  *           @arg @ref FL_CANFD_AFL_FILTER8
  *           @arg @ref FL_CANFD_AFL_FILTER9
  *           @arg @ref FL_CANFD_AFL_FILTER10
  *           @arg @ref FL_CANFD_AFL_FILTER11
  *           @arg @ref FL_CANFD_AFL_FILTER12
  *           @arg @ref FL_CANFD_AFL_FILTER13
  *           @arg @ref FL_CANFD_AFL_FILTER14
  *           @arg @ref FL_CANFD_AFL_FILTER15
  * @param    label This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_GAFL_INFO_LABEL1_0
  *           @arg @ref FL_CANFD_GAFL_INFO_LABEL1_1
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetGAFLInfoLabel1(CANFD_COMMON_Type* CANFDx, uint32_t filterX, uint32_t label)
{
    MODIFY_REG(CANFDx->CFDGAFL[filterX].CFDGAFLMr, CANFD_CFDGAFLMr_GAFLIFL1_Msk, label);
}

/**
  * @brief    Get Global Acceptance Filter List Information Label 1
  * @rmtoll   CFDGAFLMr    GAFLIFL1    FL_CANFD_Global_GetGAFLInfoLabel1
  * @param    CANFDx CANFD instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_AFL_FILTER0
  *           @arg @ref FL_CANFD_AFL_FILTER1
  *           @arg @ref FL_CANFD_AFL_FILTER2
  *           @arg @ref FL_CANFD_AFL_FILTER3
  *           @arg @ref FL_CANFD_AFL_FILTER4
  *           @arg @ref FL_CANFD_AFL_FILTER5
  *           @arg @ref FL_CANFD_AFL_FILTER6
  *           @arg @ref FL_CANFD_AFL_FILTER7
  *           @arg @ref FL_CANFD_AFL_FILTER8
  *           @arg @ref FL_CANFD_AFL_FILTER9
  *           @arg @ref FL_CANFD_AFL_FILTER10
  *           @arg @ref FL_CANFD_AFL_FILTER11
  *           @arg @ref FL_CANFD_AFL_FILTER12
  *           @arg @ref FL_CANFD_AFL_FILTER13
  *           @arg @ref FL_CANFD_AFL_FILTER14
  *           @arg @ref FL_CANFD_AFL_FILTER15
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_GAFL_INFO_LABEL1_0
  *           @arg @ref FL_CANFD_GAFL_INFO_LABEL1_1
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetGAFLInfoLabel1(CANFD_COMMON_Type* CANFDx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDGAFL[filterX].CFDGAFLMr, CANFD_CFDGAFLMr_GAFLIFL1_Msk));
}

