zmzdh/CAN_st_test/Drivers/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_canfd.h
/**
  * @brief    Set Global Reception Message Buffer Payload Data Size
  * @rmtoll   CFDRMNB    RMPLS    FL_CANFD_Global_SetRxMBPayloadDataSize
  * @param    CANFDx CANFD instance
  * @param    size This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RMPLS_SIZE_8
  *           @arg @ref FL_CANFD_RMPLS_SIZE_12
  *           @arg @ref FL_CANFD_RMPLS_SIZE_16
  *           @arg @ref FL_CANFD_RMPLS_SIZE_20
  *           @arg @ref FL_CANFD_RMPLS_SIZE_24
  *           @arg @ref FL_CANFD_RMPLS_SIZE_32
  *           @arg @ref FL_CANFD_RMPLS_SIZE_48
  *           @arg @ref FL_CANFD_RMPLS_SIZE_64
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetRxMBPayloadDataSize(CANFD_COMMON_Type* CANFDx, uint32_t size)
{
    MODIFY_REG(CANFDx->CFDRMNB, CANFD_CFDRMNB_RMPLS_Msk, size);
}

/**
  * @brief    Get Global Reception Message Buffer Payload Data Size
  * @rmtoll   CFDRMNB    RMPLS    FL_CANFD_Global_GetRxMBPayloadDataSize
  * @param    CANFDx CANFD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_RMPLS_SIZE_8
  *           @arg @ref FL_CANFD_RMPLS_SIZE_12
  *           @arg @ref FL_CANFD_RMPLS_SIZE_16
  *           @arg @ref FL_CANFD_RMPLS_SIZE_20
  *           @arg @ref FL_CANFD_RMPLS_SIZE_24
  *           @arg @ref FL_CANFD_RMPLS_SIZE_32
  *           @arg @ref FL_CANFD_RMPLS_SIZE_48
  *           @arg @ref FL_CANFD_RMPLS_SIZE_64
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetRxMBPayloadDataSize(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDRMNB, CANFD_CFDRMNB_RMPLS_Msk));
}

/**
  * @brief    Set Global Number of RX Message Buffers
  * @rmtoll   CFDRMNB    NRXMB    FL_CANFD_Global_WriteNumberOfRxMB
  * @param    CANFDx CANFD instance
  * @param    number 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteNumberOfRxMB(CANFD_COMMON_Type* CANFDx, uint32_t number)
{
    MODIFY_REG(CANFDx->CFDRMNB, (0x3fU << 0U), (number << 0U));
}

/**
  * @brief    Get Global Number of RX Message Buffers
  * @rmtoll   CFDRMNB    NRXMB    FL_CANFD_Global_ReadNumberOfRxMB
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadNumberOfRxMB(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDRMNB, (0x3fU << 0U)) >> 0U);
}

/**
  * @brief    Get Global RX Message Buffer New Data Status
  * @rmtoll   CFDRMND    RMNSu    FL_CANFD_Global_IsActiveFlag_RxMBNewData
  * @param    CANFDx CANFD instance
  * @param    rxmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXMB0
  *           @arg @ref FL_CANFD_RXMB1
  *           @arg @ref FL_CANFD_RXMB2
  *           @arg @ref FL_CANFD_RXMB3
  *           @arg @ref FL_CANFD_RXMB4
  *           @arg @ref FL_CANFD_RXMB5
  *           @arg @ref FL_CANFD_RXMB6
  *           @arg @ref FL_CANFD_RXMB7
  *           @arg @ref FL_CANFD_RXMB8
  *           @arg @ref FL_CANFD_RXMB9
  *           @arg @ref FL_CANFD_RXMB10
  *           @arg @ref FL_CANFD_RXMB11
  *           @arg @ref FL_CANFD_RXMB12
  *           @arg @ref FL_CANFD_RXMB13
  *           @arg @ref FL_CANFD_RXMB14
  *           @arg @ref FL_CANFD_RXMB15
  *           @arg @ref FL_CANFD_RXMB16
  *           @arg @ref FL_CANFD_RXMB17
  *           @arg @ref FL_CANFD_RXMB18
  *           @arg @ref FL_CANFD_RXMB19
  *           @arg @ref FL_CANFD_RXMB20
  *           @arg @ref FL_CANFD_RXMB21
  *           @arg @ref FL_CANFD_RXMB22
  *           @arg @ref FL_CANFD_RXMB23
  *           @arg @ref FL_CANFD_RXMB24
  *           @arg @ref FL_CANFD_RXMB25
  *           @arg @ref FL_CANFD_RXMB26
  *           @arg @ref FL_CANFD_RXMB27
  *           @arg @ref FL_CANFD_RXMB28
  *           @arg @ref FL_CANFD_RXMB29
  *           @arg @ref FL_CANFD_RXMB30
  *           @arg @ref FL_CANFD_RXMB31
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_RxMBNewData(CANFD_COMMON_Type* CANFDx, uint32_t rxmbX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDRMND, (CANFD_CFDRMND_RMNSu_Msk << rxmbX)) == (CANFD_CFDRMND_RMNSu_Msk << rxmbX));
}

/**
  * @brief    Clear Global RX Message Buffer New Data Status
  * @rmtoll   CFDRMND    RMNSu    FL_CANFD_Global_ClearFlag_RxMBNewData
  * @param    CANFDx CANFD instance
  * @param    rxmbX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXMB0
  *           @arg @ref FL_CANFD_RXMB1
  *           @arg @ref FL_CANFD_RXMB2
  *           @arg @ref FL_CANFD_RXMB3
  *           @arg @ref FL_CANFD_RXMB4
  *           @arg @ref FL_CANFD_RXMB5
  *           @arg @ref FL_CANFD_RXMB6
  *           @arg @ref FL_CANFD_RXMB7
  *           @arg @ref FL_CANFD_RXMB8
  *           @arg @ref FL_CANFD_RXMB9
  *           @arg @ref FL_CANFD_RXMB10
  *           @arg @ref FL_CANFD_RXMB11
  *           @arg @ref FL_CANFD_RXMB12
  *           @arg @ref FL_CANFD_RXMB13
  *           @arg @ref FL_CANFD_RXMB14
  *           @arg @ref FL_CANFD_RXMB15
  *           @arg @ref FL_CANFD_RXMB16
  *           @arg @ref FL_CANFD_RXMB17
  *           @arg @ref FL_CANFD_RXMB18
  *           @arg @ref FL_CANFD_RXMB19
  *           @arg @ref FL_CANFD_RXMB20
  *           @arg @ref FL_CANFD_RXMB21
  *           @arg @ref FL_CANFD_RXMB22
  *           @arg @ref FL_CANFD_RXMB23
  *           @arg @ref FL_CANFD_RXMB24
  *           @arg @ref FL_CANFD_RXMB25
  *           @arg @ref FL_CANFD_RXMB26
  *           @arg @ref FL_CANFD_RXMB27
  *           @arg @ref FL_CANFD_RXMB28
  *           @arg @ref FL_CANFD_RXMB29
  *           @arg @ref FL_CANFD_RXMB30
  *           @arg @ref FL_CANFD_RXMB31
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_ClearFlag_RxMBNewData(CANFD_COMMON_Type* CANFDx, uint32_t rxmbX)
{
    CLEAR_BIT(CANFDx->CFDRMND, (CANFD_CFDRMND_RMNSu_Msk << rxmbX));
}

/**
  * @brief    Set Global RX FIFO Interrupt Generation Counter Value
  * @rmtoll   CFDRFCCa    RFIGCV    FL_CANFD_Global_SetRxFIFOInterruptGenerationCounterValue
  * @param    CANFDx CANFD instance
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @param    value This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RFIGCV_1P8_FULL
  *           @arg @ref FL_CANFD_RFIGCV_1P4_FULL
  *           @arg @ref FL_CANFD_RFIGCV_3P8_FULL
  *           @arg @ref FL_CANFD_RFIGCV_1P2_FULL
  *           @arg @ref FL_CANFD_RFIGCV_5P8_FULL
  *           @arg @ref FL_CANFD_RFIGCV_3P4_FULL
  *           @arg @ref FL_CANFD_RFIGCV_7P8_FULL
  *           @arg @ref FL_CANFD_RFIGCV_FULL
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetRxFIFOInterruptGenerationCounterValue(CANFD_COMMON_Type* CANFDx, uint32_t rxfifoX, uint32_t value)
{
    MODIFY_REG(CANFDx->CFDRFCC[rxfifoX], CANFD_CFDRFCCa_RFIGCV_Msk, value);
}

/**
  * @brief    Get Global RX FIFO Interrupt Generation Counter Value
  * @rmtoll   CFDRFCCa    RFIGCV    FL_CANFD_Global_GetRxFIFOInterruptGenerationCounterValue
  * @param    CANFDx CANFD instance
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_RFIGCV_1P8_FULL
  *           @arg @ref FL_CANFD_RFIGCV_1P4_FULL
  *           @arg @ref FL_CANFD_RFIGCV_3P8_FULL
  *           @arg @ref FL_CANFD_RFIGCV_1P2_FULL
  *           @arg @ref FL_CANFD_RFIGCV_5P8_FULL
  *           @arg @ref FL_CANFD_RFIGCV_3P4_FULL
  *           @arg @ref FL_CANFD_RFIGCV_7P8_FULL
  *           @arg @ref FL_CANFD_RFIGCV_FULL
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetRxFIFOInterruptGenerationCounterValue(CANFD_COMMON_Type* CANFDx, uint32_t rxfifoX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDRFCC[rxfifoX], CANFD_CFDRFCCa_RFIGCV_Msk));
}

/**
  * @brief    Set Global RX FIFO Interrupt Mode
  * @rmtoll   CFDRFCCa    RFIM    FL_CANFD_Global_SetRxFIFOInterruptMode
  * @param    CANFDx CANFD instance
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RFIM_REACH_RFIGCV
  *           @arg @ref FL_CANFD_RFIM_EVERY_MESSAGE
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetRxFIFOInterruptMode(CANFD_COMMON_Type* CANFDx, uint32_t rxfifoX, uint32_t mode)
{
    MODIFY_REG(CANFDx->CFDRFCC[rxfifoX], CANFD_CFDRFCCa_RFIM_Msk, mode);
}

/**
  * @brief    Get Global RX FIFO Interrupt Mode
  * @rmtoll   CFDRFCCa    RFIM    FL_CANFD_Global_GetRxFIFOInterruptMode
  * @param    CANFDx CANFD instance
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_RFIM_REACH_RFIGCV
  *           @arg @ref FL_CANFD_RFIM_EVERY_MESSAGE
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetRxFIFOInterruptMode(CANFD_COMMON_Type* CANFDx, uint32_t rxfifoX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDRFCC[rxfifoX], CANFD_CFDRFCCa_RFIM_Msk));
}

/**
  * @brief    Set Global RX FIFO Depth Configuration
  * @rmtoll   CFDRFCCa    RFDC    FL_CANFD_Global_SetRxFIFODepth
  * @param    CANFDx CANFD instance
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @param    depth This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RFDC_DEPTH_0
  *           @arg @ref FL_CANFD_RFDC_DEPTH_4
  *           @arg @ref FL_CANFD_RFDC_DEPTH_8
  *           @arg @ref FL_CANFD_RFDC_DEPTH_16
  *           @arg @ref FL_CANFD_RFDC_DEPTH_32
  *           @arg @ref FL_CANFD_RFDC_DEPTH_48
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetRxFIFODepth(CANFD_COMMON_Type* CANFDx, uint32_t rxfifoX, uint32_t depth)
{
    MODIFY_REG(CANFDx->CFDRFCC[rxfifoX], CANFD_CFDRFCCa_RFDC_Msk, depth);
}

/**
  * @brief    Get Global RX FIFO Depth Configuration
  * @rmtoll   CFDRFCCa    RFDC    FL_CANFD_Global_GetRxFIFODepth
  * @param    CANFDx CANFD instance
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_RFDC_DEPTH_0
  *           @arg @ref FL_CANFD_RFDC_DEPTH_4
  *           @arg @ref FL_CANFD_RFDC_DEPTH_8
  *           @arg @ref FL_CANFD_RFDC_DEPTH_16
  *           @arg @ref FL_CANFD_RFDC_DEPTH_32
  *           @arg @ref FL_CANFD_RFDC_DEPTH_48
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetRxFIFODepth(CANFD_COMMON_Type* CANFDx, uint32_t rxfifoX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDRFCC[rxfifoX], CANFD_CFDRFCCa_RFDC_Msk));
}

/**
  * @brief    Set Global Rx FIFO Payload Data Size configuration
  * @rmtoll   CFDRFCCa    RFPLS    FL_CANFD_Global_SetRxFIFOPayloadDataSize
  * @param    CANFDx CANFD instance
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @param    size This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RFPLS_SIZE_8
  *           @arg @ref FL_CANFD_RFPLS_SIZE_12
  *           @arg @ref FL_CANFD_RFPLS_SIZE_16
  *           @arg @ref FL_CANFD_RFPLS_SIZE_20
  *           @arg @ref FL_CANFD_RFPLS_SIZE_24
  *           @arg @ref FL_CANFD_RFPLS_SIZE_32
  *           @arg @ref FL_CANFD_RFPLS_SIZE_48
  *           @arg @ref FL_CANFD_RFPLS_SIZE_64
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetRxFIFOPayloadDataSize(CANFD_COMMON_Type* CANFDx, uint32_t rxfifoX, uint32_t size)
{
    MODIFY_REG(CANFDx->CFDRFCC[rxfifoX], CANFD_CFDRFCCa_RFPLS_Msk, size);
}

/**
  * @brief    Get Global Rx FIFO Payload Data Size configuration
  * @rmtoll   CFDRFCCa    RFPLS    FL_CANFD_Global_GetRxFIFOPayloadDataSize
  * @param    CANFDx CANFD instance
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_RFPLS_SIZE_8
  *           @arg @ref FL_CANFD_RFPLS_SIZE_12
  *           @arg @ref FL_CANFD_RFPLS_SIZE_16
  *           @arg @ref FL_CANFD_RFPLS_SIZE_20
  *           @arg @ref FL_CANFD_RFPLS_SIZE_24
  *           @arg @ref FL_CANFD_RFPLS_SIZE_32
  *           @arg @ref FL_CANFD_RFPLS_SIZE_48
  *           @arg @ref FL_CANFD_RFPLS_SIZE_64
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetRxFIFOPayloadDataSize(CANFD_COMMON_Type* CANFDx, uint32_t rxfifoX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDRFCC[rxfifoX], CANFD_CFDRFCCa_RFPLS_Msk));
}

/**
  * @brief    Global RX FIFO Interrupt enable 
  * @rmtoll   CFDRFCCa    RFIE    FL_CANFD_Global_EnableIT_RxFIFO
  * @param    CANFDx CANFD instance
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_EnableIT_RxFIFO(CANFD_COMMON_Type* CANFDx, uint32_t rxfifoX)
{
    SET_BIT(CANFDx->CFDRFCC[rxfifoX], CANFD_CFDRFCCa_RFIE_Msk);
}

/**
  * @brief    Global RX FIFO Interrupt enable status 
  * @rmtoll   CFDRFCCa    RFIE    FL_CANFD_Global_IsEnabledIT_RxFIFO
  * @param    CANFDx CANFD instance
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsEnabledIT_RxFIFO(CANFD_COMMON_Type* CANFDx, uint32_t rxfifoX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDRFCC[rxfifoX], CANFD_CFDRFCCa_RFIE_Msk) == CANFD_CFDRFCCa_RFIE_Msk);
}

/**
  * @brief    Global RX FIFO Interrupt disable 
  * @rmtoll   CFDRFCCa    RFIE    FL_CANFD_Global_DisableIT_RxFIFO
  * @param    CANFDx CANFD instance
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_DisableIT_RxFIFO(CANFD_COMMON_Type* CANFDx, uint32_t rxfifoX)
{
    CLEAR_BIT(CANFDx->CFDRFCC[rxfifoX], CANFD_CFDRFCCa_RFIE_Msk);
}

/**
  * @brief    Global RX FIFO enable 
  * @rmtoll   CFDRFCCa    RFE    FL_CANFD_Global_Enable_RxFIFO
  * @param    CANFDx CANFD instance
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Enable_RxFIFO(CANFD_COMMON_Type* CANFDx, uint32_t rxfifoX)
{
    SET_BIT(CANFDx->CFDRFCC[rxfifoX], CANFD_CFDRFCCa_RFE_Msk);
}

/**
  * @brief    Global RX FIFO enable status 
  * @rmtoll   CFDRFCCa    RFE    FL_CANFD_Global_IsEnabled_RxFIFO
  * @param    CANFDx CANFD instance
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsEnabled_RxFIFO(CANFD_COMMON_Type* CANFDx, uint32_t rxfifoX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDRFCC[rxfifoX], CANFD_CFDRFCCa_RFE_Msk) == CANFD_CFDRFCCa_RFE_Msk);
}

/**
  * @brief    Global RX FIFO disable 
  * @rmtoll   CFDRFCCa    RFE    FL_CANFD_Global_Disable_RxFIFO
  * @param    CANFDx CANFD instance
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_Disable_RxFIFO(CANFD_COMMON_Type* CANFDx, uint32_t rxfifoX)
{
    CLEAR_BIT(CANFDx->CFDRFCC[rxfifoX], CANFD_CFDRFCCa_RFE_Msk);
}

/**
  * @brief    Get Global RX FIFO Message Count
  * @rmtoll   CFDRFSTSa    RFMC    FL_CANFD_Global_ReadRxFIFOMessageCount
  * @param    CANFDx CANFD instance
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadRxFIFOMessageCount(CANFD_COMMON_Type* CANFDx, uint32_t rxfifoX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDRFSTS[rxfifoX], (0x3fU << 8U)) >> 8U);
}

/**
  * @brief    Get Global RX FIFO Interrupt Flag
  * @rmtoll   CFDRFSTSa    RFIF    FL_CANFD_Global_IsActiveFlag_RxFIFO
  * @param    CANFDx CANFD instance
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_RxFIFO(CANFD_COMMON_Type* CANFDx, uint32_t rxfifoX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDRFSTS[rxfifoX], CANFD_CFDRFSTSa_RFIF_Msk) == (CANFD_CFDRFSTSa_RFIF_Msk));
}

/**
  * @brief    Clear Global RX FIFO Interrupt Flag
  * @rmtoll   CFDRFSTSa    RFIF    FL_CANFD_Global_ClearFlag_RxFIFO
  * @param    CANFDx CANFD instance
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_ClearFlag_RxFIFO(CANFD_COMMON_Type* CANFDx, uint32_t rxfifoX)
{
    CLEAR_BIT(CANFDx->CFDRFSTS[rxfifoX], CANFD_CFDRFSTSa_RFIF_Msk);
}

/**
  * @brief    Get Global RX FIFO Message Lost Flag
  * @rmtoll   CFDRFSTSa    RFMLT    FL_CANFD_Global_IsActiveFlag_RxFIFOMessageLost
  * @param    CANFDx CANFD instance
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_RxFIFOMessageLost(CANFD_COMMON_Type* CANFDx, uint32_t rxfifoX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDRFSTS[rxfifoX], CANFD_CFDRFSTSa_RFMLT_Msk) == (CANFD_CFDRFSTSa_RFMLT_Msk));
}

/**
  * @brief    Clear Global RX FIFO Message Lost Flag
  * @rmtoll   CFDRFSTSa    RFMLT    FL_CANFD_Global_ClearFlag_RxFIFOMessageLost
  * @param    CANFDx CANFD instance
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_ClearFlag_RxFIFOMessageLost(CANFD_COMMON_Type* CANFDx, uint32_t rxfifoX)
{
    CLEAR_BIT(CANFDx->CFDRFSTS[rxfifoX], CANFD_CFDRFSTSa_RFMLT_Msk);
}

/**
  * @brief    Get Global RX FIFO Full
  * @rmtoll   CFDRFSTSa    RFFLL    FL_CANFD_Global_IsActiveFlag_RxFIFOFull
  * @param    CANFDx CANFD instance
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_RxFIFOFull(CANFD_COMMON_Type* CANFDx, uint32_t rxfifoX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDRFSTS[rxfifoX], CANFD_CFDRFSTSa_RFFLL_Msk) == (CANFD_CFDRFSTSa_RFFLL_Msk));
}

/**
  * @brief    Get Global RX FIFO Empty
  * @rmtoll   CFDRFSTSa    RFEMP    FL_CANFD_Global_IsActiveFlag_RxFIFOEmpty
  * @param    CANFDx CANFD instance
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_IsActiveFlag_RxFIFOEmpty(CANFD_COMMON_Type* CANFDx, uint32_t rxfifoX)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDRFSTS[rxfifoX], CANFD_CFDRFSTSa_RFEMP_Msk) == (CANFD_CFDRFSTSa_RFEMP_Msk));
}

/**
  * @brief    Set Global RX FIFO Pointer
  * @rmtoll   CFDRFPCTRa    RFPC    FL_CANFD_Global_WriteRxFIFOPointer
  * @param    CANFDx CANFD instance
  * @param    rxfifoX This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_RXFIFO0
  *           @arg @ref FL_CANFD_RXFIFO1
  * @param    pointer 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteRxFIFOPointer(CANFD_COMMON_Type* CANFDx, uint32_t rxfifoX, uint32_t pointer)
{
    MODIFY_REG(CANFDx->CFDRFPCTR[rxfifoX], (0xffU << 0U), (pointer << 0U));
}

/**
  * @brief    Set Global Common FIFO Interval Transmission Time
  * @rmtoll   CFDCFCC    CFITT    FL_CANFD_Global_WriteCommonFIFOIntervalTransmissionTime
  * @param    CANFDx CANFD instance
  * @param    time 
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_WriteCommonFIFOIntervalTransmissionTime(CANFD_COMMON_Type* CANFDx, uint32_t time)
{
    MODIFY_REG(CANFDx->CFDCFCC, (0xffU << 24U), (time << 24U));
}

/**
  * @brief    Get Global Common FIFO Interval Transmission Time
  * @rmtoll   CFDCFCC    CFITT    FL_CANFD_Global_ReadCommonFIFOIntervalTransmissionTime
  * @param    CANFDx CANFD instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_ReadCommonFIFOIntervalTransmissionTime(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDCFCC, (0xffU << 24U)) >> 24U);
}

/**
  * @brief    Set Global Common FIFO Depth Configuration
  * @rmtoll   CFDCFCC    CFDC    FL_CANFD_Global_SetCommonFIFODepth
  * @param    CANFDx CANFD instance
  * @param    depth This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_CFDC_DEPTH_0
  *           @arg @ref FL_CANFD_CFDC_DEPTH_4
  *           @arg @ref FL_CANFD_CFDC_DEPTH_8
  *           @arg @ref FL_CANFD_CFDC_DEPTH_16
  *           @arg @ref FL_CANFD_CFDC_DEPTH_32
  *           @arg @ref FL_CANFD_CFDC_DEPTH_48
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetCommonFIFODepth(CANFD_COMMON_Type* CANFDx, uint32_t depth)
{
    MODIFY_REG(CANFDx->CFDCFCC, CANFD_CFDCFCC_CFDC_Msk, depth);
}

/**
  * @brief    Get Global Common FIFO Depth Configuration
  * @rmtoll   CFDCFCC    CFDC    FL_CANFD_Global_GetCommonFIFODepth
  * @param    CANFDx CANFD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CANFD_CFDC_DEPTH_0
  *           @arg @ref FL_CANFD_CFDC_DEPTH_4
  *           @arg @ref FL_CANFD_CFDC_DEPTH_8
  *           @arg @ref FL_CANFD_CFDC_DEPTH_16
  *           @arg @ref FL_CANFD_CFDC_DEPTH_32
  *           @arg @ref FL_CANFD_CFDC_DEPTH_48
  */
__STATIC_INLINE uint32_t FL_CANFD_Global_GetCommonFIFODepth(CANFD_COMMON_Type* CANFDx)
{
    return (uint32_t)(READ_BIT(CANFDx->CFDCFCC, CANFD_CFDCFCC_CFDC_Msk));
}

/**
  * @brief    Set Global Common FIFO TX Message Buffer Link
  * @rmtoll   CFDCFCC    CFTML    FL_CANFD_Global_SetCommonFIFOTxMBLink
  * @param    CANFDx CANFD instance
  * @param    number This parameter can be one of the following values:
  *           @arg @ref FL_CANFD_CFTML_TXMB0
  *           @arg @ref FL_CANFD_CFTML_TXMB1
  *           @arg @ref FL_CANFD_CFTML_TXMB2
  *           @arg @ref FL_CANFD_CFTML_TXMB3
  * @retval   None
  */
__STATIC_INLINE void FL_CANFD_Global_SetCommonFIFOTxMBLink(CANFD_COMMON_Type* CANFDx, uint32_t number)
{
    MODIFY_REG(CANFDx->CFDCFCC, CANFD_CFDCFCC_CFTML_Msk, number);
}

